Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The largest number that can be converted is 2147483647 in decimal resulting to "17777777777".
es: El mayor número que puede ser ocnvertido es 2147483647 en decimal resultando "17777777777".

source: See also octdec().
es: Vea también octdec().

source: See also define(), constant(), get_defined_constants() and the section on Constants.
es: Véase también define() y la sección Constantes.

source: Defines a named constant.
es: Define una constante con nombre, que es similar a una variable, excepto que:

source: See the section on constants for more details.
es: Las constantes no tienen un símbolo dólar '$' precediéndolas;

source: The name of the constant is given by name; the value is given by value.
es: Las constantes son accesibles desde cualquier lugar sin tener en cuenta las reglas de ámbito de las variables.

source: The optional third parameter case_insensitive is also available.
es: Las constantes sólo pueden evaluar valores escalares

source: If the value TRUE is given, then the constant will be defined case-insensitive.
es: El tercer parámetro opcional case_insensitive también se encuentra disponible.

source: The default behaviour is case-sensitive; i.e.
es: Si se da el valor 1, la constante se definirá no dintinguiendo mayúsculas / minusculas.

source: CONSTANT and Constant represent different values.
es: El comportamiento por defecto es si distinguir; i.e.

source: Defining Constants
es: Ejemplo 1.

source: ?php define ("CONSTANT", "Hello world ."); echo CONSTANT; / / outputs "Hello world. "echo Constant; / / outputs "Constant" and issues a notice. define ("GREETING", "Hello you .",TRUE); echo GREETING; / / outputs "Hello you. "echo Greeting; / / outputs "Hello you."?
es: ?php define( "CONSTANT", "Hello world ."); echo CONSTANT; / / outputs "Hello world. "?

source: See also defined(), constant() and the section on Constants.
es: Véase también defined() y la sección Constantes.

source: This is a dummy manual entry to satisfy those people who are looking for unlink() or unset() in the wrong place.
es: Esto es una entrada manual inútil para satisfacer a esas personas que están buscando unlink() o unset() en el lugar equivocado.

source: See also: unlink() to delete files, unset() to delete variables.
es: Ver también: unlink() para borrar ficheros, unset() para borrar variables.

source: The dgettext() function allows you to override the current domain for a single message lookup.
es: La función dgettext() permite omitir el dominio actual para una única busqueda.

source: This function is an alias of exit().
es: Esta construcción del lenguaje envía a la salida un mensaje y finaliza la ejecución del script.

source: Example 1. dirname() example
es: En Windows, tanto la barra (/) como la barra inversa (\) son usadas como separadores de caracteres.

source: In PHP 4.0.3, dirname() was fixed to be POSIX-compliant.
es: Ejemplo 1.

source: Essentially, this means that if there are no slashes in path, a dot ('.') is returned, indicating the current directory.
es: Ejemplo de dirname()

source: Note that this means that you will often get a slash or a dot back from dirname() in situations where the older functionality would have given you the empty string.
es: $path = "/ etc / passwd"; $file = dirname($path); / / $file toma el valor" / etc "

source: See also: basename(), pathinfo(), and realpath().
es: Ver también: basename()

source: Example 1. disk_free_space() example
es: Ejemplo 1. disk_free_space() example

source: This is a deprecated alias of disk_free_space().
es: Ejemplo 1.

source: Use that function instead.
es: $df = diskfreespace( "/ "); / / $df contiene el numero de bytes / / disponibles en" / "

source: Example 1. disk_total_space() example
es: Ejemplo 1. disk_total_space() example

source: This alias is a left-over from a function-renaming.
es: var puede ser cualquier tipo escalar.

source: In older versions of PHP you' ll need to use this alias of the floatval() function, because floatval() wasn't yet available in that version.
es: Ver también intval(), strval(), settype() y Type juggling.

source: Returns the current key and value pair from the array array and advances the array cursor.
es: Devuelve el par clave / valor actual para la matriz y avanza el cursor de la misma.

source: This pair is returned in a four-element array, with the keys 0, 1, key, and value.
es: Esta pareja se devuele en una matriz de 4 elementos, con las claves 0, 1, key, y value.

source: Elements 0 and key contain the key name of the array element, and 1 and value contain the data.
es: Los elementos 0 y key contienen el nombre de clave del elemento de la matriz, y 1 y value contienen los datos.

source: If the internal pointer for the array points past the end of the array contents, each() returns FALSE.
es: Si el puntero interno para la matriz apunta pasado el final del contenido de la matriz, each() devuelve FALSE.

source: Example 1. each() examples
es: Ejemplos de each()

source: $foo = array ("bob", "fred", "jussi", "jouni", "egon", "marliese"); $bar = each ($foo);
es: $chorrada = array ("bob", "fred", "jussi", "jouni", "egon", "marliese"); $tonteria = each ($chorrada);

source: $bar now contains the following key / value pairs:
es: $tonteria contiene ahora los siguientes pares clave / valor:

source: $foo = array ("Robert "= "Bob", "Seppo" = "Sepi"); $bar = each ($foo);
es: $chorrada = array ("Robert "= "Bob", "Seppo" = "Sepi"); $tonteria = each ($chorrada);

source: each() is typically used in conjunction with list() to traverse an array; for instance, $_POST:
es: each() se usa normalmente de forma conjunta a list() para recorrer una matriz; por ejemplo, $HTTP_POST_VARS:

source: Traversing $_POST with each()
es: Recorriendo $HTTP_POST_VARS con each()

source: echo "Values submitted via POST method: br / \n"; reset ($_POST); while (list ($key, $val) = each ($_POST)) {echo "$key = $val br / \n";}
es: echo "Valores enviados con el método POST: br"; reset ($HTTP_POST_VARS); while (list ($clave, $val) = each ($HTTP_POST_VARS)) {echo "$clave = $val br ";}

source: You have to use reset() if you want to traverse the array again using each.
es: Cuando se ha ejecutado each(), el cursor de la matriz quedará en el siguiente elemento de la misma, o en el último si llega al final de ésta.

source: See also key(), list(), current(), reset(), next(), prev(), and foreach.
es: Vea también: key(), list(), current(), reset(), next(), y prev().

source: Returns the UNIX timestamp corresponding to midnight on Easter of the given year.
es: Devuelve la marca de tiempo UNIX que corresponde a la medianoche de Pascua del año dado.

source: Since PHP 4.3.0, the year parameter is optional and defaults to the current year according to the localtime if ommited.
es: A partir de PHP 4.3.0, el parametro anno es opcional y si se omite, usa por defecto el año en curso según "localtime".

source: This function will generate a warning if the year is outside of the range for UNIX timestamps (i.e. before 1970 or after 2037).
es: Esta función generará un aviso si el año está fuera del rango para las marcas de tiempo del UNIX (es decir, antes de 1970 o después del 2037).

source: Example 1. easter_date() example
es: Ejemplo 1. ejemplo de easter_date()

source: The date of Easter Day was defined by the Council of Nicaea in AD325 as the Sunday after the first full moon which falls on or after the Spring Equinox.
es: La fecha del Día de Pascua fue definida por el Concilio de Nicea en el 325 D.C. como el domingo tras la primera luna llena que cayera en ó después del equinoccio de Primavera.

source: The Equinox is assumed to always fall on 21st March, so the calculation reduces to determining the date of the full moon and the date of the following Sunday.
es: El equinoccio se supone que siempre cae en el 21 de marzo, de modo que el cálculo se reduce a determinar la fecha de la luna llena y la del domingo siguiente.

source: The algorithm used here was introduced around the year 532 by Dionysius Exiguus.
es: El algoritmo usado aquí fue introducido en el año 532 por Dionisio Exiguo.

source: Under the Julian Calendar (for years before 1753) a simple 19-year cycle is used to track the phases of the Moon.
es: Bajo el Calendario Juliano (para años anteriores al 1753), se usa un ciclo simple de 19 años para calcular las fases de la luna.

source: Under the Gregorian Calendar (for years after 1753 - devised by Clavius and Lilius, and introduced by Pope Gregory XIII in October 1582, and into Britain and its then colonies in September 1752) two correction factors are added to make the cycle more accurate.
es: Bajo el Calendario Gregoriano (años posteriores al 1753, diseñado por Clavio y Lilio, e introducido por el Papa Gregorio XIII en Octubre de 1582, y en Gran Bretaña y sus colonias en septiembre de 1752) se añaden dos factores de corrección para hacer el ciclo más preciso.

source: (The code is based on a C program by Simon Kershaw, webmaster@ely.anglican.org)
es: (El código se basa en un programa en C de Simon Kershaw, webmaster@ely.anglican.org)

source: See easter_days() for calculating Easter before 1970 or after 2037.
es: Ver easter_days() para calcular la Pascua antes del 1970 o después del 2037.

source: Returns the number of days after March 21 on which Easter falls for a given year.
es: Devuelve el número de días tras el 21 de marzo en que cae la Pascua en un año dado.

source: If no year is specified, the current year is assumed.
es: Si no se especifica año, se asume el actual.

source: The method parameter was also introduced in PHP 4.3.0 and allows to calculate easter dates based on the Gregorian calendar during the years 1582 - 1752 when set to CAL_EASTER_ROMAN.
es: El parámetro metodo fue introducido en la version PHP 4.3.0 y permite calcular fechas de pascua basadas en el Calendario Gregoriano durante los años 1582 - 1752 si se le da el valor CAL_EASTER_ROMAN.

source: See the calendar constants for more valid constants.
es: Ver las constantes de calendario para más información sobre estas constantes.

source: This function can be used instead of easter_date() to calculate Easter for years which fall outside the range of UNIX timestamps (i.e. before 1970 or after 2037).
es: Esta función se puede usar en lugar de easter_date() para calcular la Pascua para años que se salen del rango de las marcas de fecha del UNIX (o sea, antes del 1970 o después del 2037).

source: Example 1. easter_days() example
es: Ejemplo 1. ejemplo de easter_date()

source: See also easter_date().
es: Vea también easter_date().

source: echo() is not actually a function (it is a language construct) so you are not required to use parentheses with it.
es: Da salida a todos sus parámetros.

source: It is not possible to use echo() in a variable function context.
es: echo() no es realmente una función (es una sentencia del lenguaje) de modo que no se requiere el uso de los paréntesis.

source: Example 1. echo() examples
es: Ejemplo 1.

source: ?php echo "Hello World"; echo "This spans multiple lines.
es: Ejemplo de echo()

# The newlines will be output as well"; echo "This spans multiple lines.
source: The newlines will be output as well"; echo "This spans\nmultiple lines.
es: echo "Hola Mundo"; echo "Esto se extiende por varias líneas.

source: Note that the here document terminator must appear on a line with just a semicolon no extra whitespace!
es: Los saltos de línea también se envían"; echo "Esto se extiende\npor varias líneas.

source: echo() also has a shortcut syntax, where you can immediately follow the opening tag with an equals sign.
es: Los saltos de línea\ntambién se envían";

source: I have ?=$foo? foo.
es: Nota:

source: This short syntax only works with the short_open_tag configuration setting enabled.
es: De hecho, si desea pasar más de un parámetro a echo no debe encerrarlos entre paréntesis.

source: See also print(), printf(), and flush().
es: Vea también: print(), printf(), y flush().

source: See converting to boolean for more information.
es: Devuelve FALSE si var está definida y tiene un valor no-vacío o distinto de cero; en otro caso devuelve TRUE.

source: Note that this is meaningless when used on anything which isn' t a variable; i.e. empty (addslashes ($name)) has no meaning since it would be checking whether something which isn't a variable is a variable with a FALSE value.
es: Ver también isset() y unset().

source: See also current(), each(), next(), and reset().
es: Vea también: current(), each(), end(), next(), y reset().

source: Searches a string for matches to the regular expression given in pattern.
es: Busca en string las coincidencias con la expresión regular pattern.

source: Up to (and including) PHP 4.1.0 $regs will be filled with exactly ten elements, even though more or fewer than ten parenthesized substrings may actually have matched.
es: La búsqueda diferencia mayúsculas y minúsculas.

source: If no matches are found, $regs will not be altered by ereg().
es: Devuelve un valor verdadero si se encontró alguna coincidencia, o falso in no se encontraron coincidencias u ocurrió algún error.

source: Returns TRUE if a match for pattern was found in string, or FALSE if no matches were found or an error occurred.
es: El siguiente fragmento de código toma una fecha en formato ISO (AAAA-MM-DD) y la imprime en formato DD.MM.AAAA:

source: The following code snippet takes a date in ISO format (YYYY-MM-DD) and prints it in DD.MM.YYYY format:
es: Ejemplo 1. ereg() example

source: See also eregi(), ereg_replace(), eregi_replace(), and preg_match().
es: Ver también eregi(), ereg_replace(), y eregi_replace().

source: Example 1. eregi() example
es: Esta función es idéntica a ereg(), excepto en que ignora la distinción entre mayúsculas y minúsculas.

source: See also ereg(), ereg_replace(), and eregi_replace().
es: Ver también ereg(), ereg_replace(), y eregi_replace().

source: This function is identical to ereg_replace() except that this ignores case distinction when matching alphabetic characters.
es: Esta función es idéntica a ereg_replace(), excepto en que ignora la distinción entre mayúsculas y minúsculas.

source: See also ereg(), eregi(), and ereg_replace().
es: Ver también ereg(), eregi(), y ereg_replace().

source: This function scans string for matches to pattern, then replaces the matched text with replacement.
es: Esta función examina string buscando coincidencias de pattern, y reemplaza el texto encontrado con replacement.

source: If pattern contains parenthesized substrings, replacement may contain substrings of the form\\ digit, which will be replaced by the text matching the digit' th parenthesized substring; \\0 will produce the entire contents of string.
es: Devuelve la cadena modificada.

source: Parentheses may be nested, in which case they are counted by the opening parenthesis.
es: Si no hay coincidencias que reemplazar, devuelve la cadena original.

source: For example, the following code snippet prints "This was a test" three times:
es: Si pattern contiene subcadenas entre paréntesis, replacement puede contener subcadenas de la forma\\ cifra, que serán reemplazadas por el texto que coincide con la subcadena entre paréntesis que ocupa el lugar indicado por la cifra; \\0 produce el contenido total de la cadena.

source: Example 1. ereg_replace() Example
es: Se pueden usar hasta nueve subcadenas.

source: $string = "This is a test"; echo ereg_replace (" is", "was", $string); echo ereg_replace (" ()is", "\\1was", $string); echo ereg_replace ("( ()is)", "\\2was", $string);
es: Los paréntesis pueden anidarse; en este caso se cuentan los paréntesis de apertura.

source: One thing to take note of is that if you use an integer value as the replacement One thing to take note of is that if you use an integer value as the replacement parameter, you may not get the results you expect.
es: Si no se encuentran coincidencias en string, se devuelve string sin cambios.

source: For instance:
es: Por ejemplo, el siguiente fragmento de código imprime "This was a test" tres veces:

source: ?php / * This will not work as expected. * / $num = 4; $string = "This string has four words ."; $string = ereg_replace('four', $num, $string); echo $string; / * Output: 'This string has words. '* / / * This will work. * / $num = '4'; $string = "This string has four words ."; $string = ereg_replace('four', $num, $string); echo $string; / * Output: 'This string has 4 words.' * /?
es: Ejemplo 1. ereg_replace() example

source: $text = ereg_replace( "[[:alpha :]]+: / /[^ [:space :]]+[[:alnum:] / ]", "a href=\"\\0\" \\0 / a ", $text);
es: $string = "This is a test"; echo ereg_replace (" is", "was", $string); echo ereg_replace (" ()is", "\\1was", $string); echo ereg_replace ("( ()is)", "\\2was", $string);

source: See also ereg(), eregi(), eregi_replace(), str_replace(), and preg_match().
es: Ver también ereg(), eregi(), y eregi_replace().

source: Sends an error message to the web server 's error log, a TCP port or to a file.
es: Envía un mensaje de error al log de errores del servidor web, a un puerto TCP o a un fichero.

source: The first parameter, message, is the error message that should be logged.
es: El primer parámetro, message (mensaje), es el mensaje de error que debe ser registrado.

source: The second parameter, message_type says where the message should go:
es: El segundo parámetro, message_type (tipo de mensaje) indica el lugar al que debe dirigirse:

source: Table 1. error_log() log types
es: Tabla 1. error_log() tipos de log

source: message is sent to PHP' s system logger, using the Operating System's system logging mechanism or a file, depending on what the error_log configuration directive is set to.
es: message es enviado al registro de sistema de PHP, utilizando el mecanismo de registro de sistema del Sistema Operativo, o a un fichero, dependiendo del valor de la directiva de configuración error_log

source: message is sent by email to the address in the destination parameter.
es: message es enviado por correo electrónico a la dirección del parámetro destination (destino).

source: This is the only message type where the fourth parameter, extra_headers is used.
es: Este es el único tipo de mensaje donde se utiliza el cuarto parámetro, extra_headers.

source: This message type uses the same internal function as mail() does.
es: Este tipo de mensaje utiliza la misma funcionalidad interna que mail() realiza.

source: message is sent through the PHP debugging connection.
es: message es enviado a través de la conexión de depuración de PHP.

source: This option is only available if remote debugging has been enabled.
es: Esta opción está disponible sólo si la depuración remota ha sido activada.

source: Remote debugging via TCP / IP is a PHP 3 feature that is not available in PHP 4.
es: message es añadido al fichero destination.

source: Example 1. error_log() examples
es: Ejemplo 1. error_log() ejemplos

source: error_reporting() sets PHP's error reporting level, and returns the old level.
es: Establece el nivel de registro de los errores PHP y devuelve el nivel anterior.

source: As error levels are added, the range of integers increases, so older integer-based error levels will not always behave as expected.
es: El nivel de registro es una máscara de bits de los valores siguientes (siga los enlaces a los valores internos para obtener sus significados):

source: Example 1. error_reporting() examples
es: Tabla 1. error_reporting() valores de bit

source: The available error level constants are listed below.
es: valor

source: Table 1. error_reporting() level constants and bit values
es: nombre interno

source: escapeshellcmd() escapes any characters in a string that might be used to trick a shell command into executing arbitrary commands.
es: EscapeShellCmd() enmascara cualquier carácter en una cadena de caracteres que pueda usarse para introducir fraudulentamente una orden al intérprete de órdenes para que éste ejecute instrucciones arbitrarias.

source: This function should be used to make sure that any data coming from user input is escaped before this data is passed to the exec() or system() functions, or to the backtick operator.
es: Esta función se debería usar para asegurarse que cualquier dato que venga del usuario se enmascare antes de que éste se le pase a las funciones exec() o system(), o al operador ` (apóstrofe invertido).

source: A standard use would be:
es: Un uso habitual podría ser:

source: See also escapeshellarg(), exec(), popen(), system(), and the backtick operator.
es: Véase también exec(), popen(), system(), y el operador ` (apóstrofe invertido).

source: Among other things, this can be useful for storing code in a database text field for later execution.
es: eval() evalúa la cadena de carácteres dada en code_str eval() evalúa la cadena de carácteres dada en code_str como código PHP.

source: Remember that the string passed must be valid PHP code, including things like terminating statements with a semicolon so the parser doesn' t die on the line after the eval(), and properly escaping things in code_str.
es: Hay algunos aspectos a tener en cuenta cuando se utiliza eval().

source: A return statement will terminate the evaluation of the string immediately.
es: Recuerde que la cadena de carácteres pasada debe ser código PHP válido, incluyendo aspectos como sentencias de terminación con un punto y coma para que el parser no finalice en la línea después de eval(), y secuencias de formato correctas en code_str.

source: In PHP 4, eval() returns NULL unless return() is called in the evaluated code, in which case the value passed to return() In PHP 4, eval() returns NULL unless return() is called in the evaluated code, in which case the value passed to return() is returned.
es: Recuerde también que las variables a las que se les da valor en eval() retendrán estos valores posteriormente en el script principal.

source: In PHP 3, eval() does not return a value.
es: Ejemplo 1.

source: Example 1. eval() example - simple text merge
es: Ejemplo eval() - fusión en un único texo

source: The above example will show:
es: ?php $string = 'cup'; $name = 'coffee'; $str = 'This is a $string with my $name in it. br'; echo $str; eval ("\$str = \"$str\"; "); echo $str;?

source: This is a $string with my $name in it.
es: El ejemplo anterior mostrará:

source: exec() executes the given command, however it does not output anything.
es: exec() ejecuta la orden indicada en command, sin embargo no produce ninguna salida.

source: It simply returns the last line from the result of the command.
es: Simplemente devuelve la última línea de la salida resultado de la orden.

source: If the array argument is present, then the specified array will be filled with every line of output from the command.
es: Si necesita ejecutar una orden y obtener directamente todos los datos devueltos por la orden sin ninguna interferencia, use la función PassThru().

source: Note that if the array already contains some elements, exec() will append to the end of the array.
es: Si el parámetro array Si el parámetro array existe, entonces el array especificado se rellenará con cada una de las líneas de la salida producida por la orden.

source: If you do not want the function to append elements, call unset() on the array before passing it to exec().
es: Notar que si el array ya contiene algunos elementos, exec() los añadirá al final del array.

source: If you are going to allow data coming from user input to be passed to this function, then you should be using escapeshellarg() or escapeshellcmd() to make sure that users cannot trick the system into executing arbitrary commands.
es: Si el parámetro return_var existe a la vez que el parámetro array, entonces el valor de retorno de la orden ejecutada se guardará en dicha variable.
